Repository: Yazan99sh/pos_support_package
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Error happened
ar: حدث خطأ ما

# statusCodeOk
source: Every thing is ok
ar: كل شيء على ما يرام

# loginSuccess
source: You logging in successfully
ar: تم تسجيل الدخول بنجاح

source: Warning
ar: ملاحظة هامة

source: Try again
ar: حاول مجددا

source: Please check your internet connection
ar: من فضلك افحص شبكة الانترنت الخاصة بك

source: Refresh
ar: تحديث

source: This error happened
ar: هذا الخطأ حدث

source: Confirm
ar: تأكيد

source: Cancel
ar: إلغاء

# welcome
source: Welcome to
ar: أهلا بك في

# youBusinessPartner
source: Your number 1 business partner
ar: شريكك الرقم 1 في عالم الأعمال

source: Initial Setup
ar: الإعداد الأولي

# pleaseCompleteField
source: This field cannot be empty
ar: من فضلك اكمل الحقل

source: Enter terminal ID
ar: ادخل رقم المكينة

source: Submit
ar: إرسال

source: Terminal ID is missing
ar: رقم الماكيند مفقود

# poorInternetConnection
source: Offline
ar: اوفلاين

# goodInternetConnection
source: Online
ar: اونلاين

# weDoNotHaveAccessForThis
source: We don't have permission to access your device information
ar: ليس لدينا الصلاحيات للحصول علي رقم الماكينة

source: Enter POS number
ar: ادخل معرف الجهاز

source: POS number is missing
ar: معرف الجهاز مفقود

# thereIsSomeIssue
source: There is some issues please try to contact support , or try again
ar: هناك بعض المشاكل الرجاء التواصل مع الدعم أو إعادة المحاولة لاحقا

source: Success :)
ar: تمت العملية بنجاح

# dataFetchedSuccessfully
source: Data fetched from server successfully
ar: تم تحميل البيانات بنجاح من المخدم

source: Categories
ar: التصنيفات الرئيسية

source: Loading
ar: جاري التحميل

source: SubCategories
ar: التصنيفات الفرعية

source: Products
ar: المنتجات

# param
source: Merchant param
ar: بيانات التاجر

source: Loading Data
ar: جاري التحميل

source: Completed
ar: انتهت

source: Login
ar: تسجيل الدخول

# loginGreeting
source: Log in to your SMART E-PAY account
ar: قم بتسجيل الدخول لحسابك على بوابة الدفع الذكية

source: Unknown
ar: غير معروف

source: Branch
ar: فرع

source: Enter your password
ar: قم بإدخال كلمة المرور

source: Password
ar: كلمة المرور

source: Password too short
ar: كلمة المرور قصيرة

# layoutDownloaded
source: Layout downloaded successfully
ar: تم تحميل تنسيق الطباعة

# layoutSaved
source: Layout saved successfully
ar: تم حفظ ملف تنسيق الطباعة بنجاح

source: Search
ar: ابحث

source: Total
ar: الإجمالي

source: Back
ar: عودة

source: Net
ar: صافي

source: Discount
ar: خصم

source: PAY
ar: دفع

source: Cart
ar: السلة

source: Payment Info
ar: معلومات الدفع

source: Cash
ar: نقدا

source: Credit Card
ar: بطاقة ائتمان

source: Nfc
ar: ان اف سي

source: Tax
ar: ضريبة

# pleaseTapNfcCard
source: Please tap nf card
ar: من فضلك ضع بطاقتك على الجهاز

source: Nfc Card Info
ar: معلومات البطاقة

source: Name
ar: الاسم

source: Phone number
ar: رقم الهاتف

source: Card status
ar: حالة البطاقة

source: Card type
ar: نوع البطاقة

source: Account point
ar: رصيد البطاقة

source: Expiry date
ar: تاريخ الانتهاء

source: Membership number
ar: رقم العضوية

source: Address
ar: العنوان

source: Position
ar: الوظيفة

# areSureAboutCompletingRecall
source: Are sure about going to completing recall screen
ar: هل انت متأكد من رغبتك الذهاب لواجهة المزامنة

source: Balance
ar: الرصيد

source: Active
ar: فعال

source: Inactive
ar: غير فعال

# noEnoughMoney
source: Cannot complete payment there is no enough balance
ar: لايمكن استكمال عملية الدفع لعدم وجود رصيد كافي

source: Menu
ar: القائمة

source: Logout
ar: تسجيل خروج

source: Home
ar: الرئيسية

source: OFFLINE
ar: متصل

source: ONLINE
ar: غير متصل

source: Incorrect password
ar: كلمة مرور غير صحيحة

source: Bank
ar: بنك

source: Credit customer
ar: رصيد الزبون

source: Enter bank or visa number
ar: ادخل رقم البنك او الفيزا

# bankOrVisaNumber
source: Bank/Visa number
ar: رقم بنك / فيزا

# bankOrVisaMissing
source: Bank/Visa number is missing
ar: رقم بنك/فيزا مفقود

source: Proceed
ar: متابعة

source: payment method
ar: طريقة الدفع

source: Thank you !
ar: شكرا جزيلا

# transactionsWasSuccessful
source: The transactions was successful
ar: تمت المعاملة بنجاح

source: Date
ar: تاريخ

source: Time
ar: وقت

source: Amount
ar: التكلفة

source: Done
ar: تم

source: Reprint
ar: إعادة طباعة

source: Cashier Copy
ar: نسخة الكاشير

source: AED
ar: د.إ

source: Percentage
ar: المئوية

# enterDiscountValue
source: discount value
ar: قيمة الخصم

source: Discount mode
ar: نظام الخصم

# reduceDiscountValue
source: Reduce discount value please .
ar: من فضلك قم بتقليل قيمة الخصم

source: Choose discount mode and value .
ar: من فضلك قم باختيار نوع وقيمة الخصم

source: Empty cart !
ar: السلة فارغة

source: Download Images
ar: تحميل الصور

source: Images Saved
ar: تم حفظ الصور

source: Downloading
ar: جاري التحميل

source: Print
ar: اطبع

# multiSalesNotAllowedToAddNewProductClearCart
source: You cannot add new items ,Multi sales not allowed please contact our support or confirm clear cart
ar: لايمكن إضافة عنصر جديد , الرجاء التواصل مع الدعم أو تأكيد عملية تهيئة الفاتورة

# selectReceiptToReprint
source: Select the receipt you want to reprint
ar: ادخل الفاتورة التي تريد إعادة طباعتها

source: Enter receipt number
ar: ادخل رقم الفاتورة

source: Or
ar: أو

# reprintTheLastReceipt
source: Reprint the last transaction
ar: طباعة آخر فاتورة

source: No Receipt
ar: لايوجد معاملة

# pleaseEnterTrxToReprint
source: Please enter transactions number to reprint
ar: ادخل رقم معاملة لإعادة طباعتها

source: Printing .... :)
ar: جاري الطباعة ... (:

source: Claim
ar: أسترداد

source: Select receipt to claim
ar: اختر فاتورة لاسترداد

source: Partial claim
ar: استرداد جزئي

source: Not implemented yet
ar: الميزة غير متوفرة في الوقت الحالي

# pleaseEnterTrxToClaim
source: Please enter transactions to claim
ar: من فضلك ادخل رقم الفاتورة لاسترجاعها

source: Claim Number
ar: رقم المرتجع

# andTransactionID
source: And the transactions ID is
ar: و رقم المعاملة هو

# claimMessage
source: Your claim has been done, Claim No is
ar: لقد تم استرجاع الفاتورة بنجاح , ورقمها هو

source: Merchant ID
ar: معرف التاجر

source: Terminal ID
ar: رقم الماكينة

source: Claim Success
ar: تمت عملية الاسترجاع بنجاح

source: Select products to claim .
ar: اختر العناصر التي تريد استرجاعها

source: Transactions Sync
ar: مزامنة المعاملات

source: Sync
ar: مزامنة

source: Receipt No
ar: رقم الفاتورة

source: Syncing
ar: جاري المزامنة

source: Transaction
ar: معاملة

source: out
ar: من

source: Transactions synced
ar: معاملة تم مزامنتها

source: Reserved
ar: محجوزة

source: Not Synced
ar: غير مزامنة

source: Claimed
ar: مسترجعة

source: Choose merchant
ar: اختر بائع

source: Are you sure about changing this merchant ?
ar: هل أنت متأكد من رغبتك في تغيير هذا البائع

# thereIsTransactionsNotSynced
source: There is {v} transactions not being synced , Please check your internet connections
ar: هناك {v} معاملة لم يتم مزامنتها الرجاء التحقق من اتصالك بالانترنت

# enterSuperPassword
source: Super password
ar: ادخل كلمة السر الخاصة

# areSureAboutDeletingAllDataInThisDevice
source: Are you sure about deleting all data in this device
ar: هل أنت متأكد في رغبتك بحذف جميع بيانات الحساب

source: Combo report
ar: تقرير مختصر

source: Total earning
ar: إجمالي الأرباح

source: Yearly earning
ar: إجمالي الأرباح السنوية

source: Day
ar: اليوم

source: Gross Sale
ar: إجمالي المبيعات

# taxCollected
source: Tax Collectd
ar: الضرائب

source: refunds
ar: المرتجعات

source: Yearly Based
ar: أساس سنوي

# enterSupervisorPassword
source: Super password
ar: كلمة سر المشرف

source: This feature need supervisor permission
ar: هذه الميزة تحتاج إلى إذن المشرف

# thisItemClaimed
source: !! This Item It's Claimed
ar: !! هذا العنصر تم استرجاعه

source: Enter price
ar: أدخل السعر

source: Invalid value
ar: قيمة غير صالحة

source: Open product
ar: إضافة منتج مخصص

# pleaseEnterOpenPrice
source: This product an open price product please enter wanted price for this item
ar: هذا المنتج ذو سعر مفتوح من فضلك قم بتزويدنا بالسعر المطلوب

# productAlreadyInTheCart
source: Product already in cart !
ar: العنصر موجود بالسلة !

source: Report
ar: التقرير

source: Please choose payment method
ar: من فضلك اختر طريقة للدفع

source: Show All
ar: الكل

source: This Invoice is claimed
ar: هذه الفاتورة مسترجعة

source: Transaction not found
ar: المعاملة غير موجودة

# transactionUnderClaim
source: Transactions under claimed
ar: تم استرجاع المعاملة بنجاح

source: Claim synced
ar: تمت المزامنة

source: Settings
ar: الإعدادات

source: Common
ar: شائعة

source: Check for updates
ar: التحقق من التحديثات

source: Complete recall
ar: تحديث بيانات التطبيق

source: Partial recall
ar: تحديث بيانات جزئي

source: Language
ar: اللغة

source: Change terminal
ar: تغيير رقم الماكينة

# areSureAboutPartialRecall
source: Are you sure about making partial recall
ar: هل أنت متأكد في رغبتك في تحديث البيانات الجزئي

source: Change language
ar: تغيير اللغة

source: Secondary
ar: ثانوي

source: Apk Updated
ar: تم تحديث التطبيق

source: Check
ar: شيك

source: Multi payment
ar: دفع متعدد

source: Save
ar: حفظ

source: Please reduce selected amount
ar: من فضلك قلل من الكمية المختارة لتجاوزها المبلغ المطلوب دفعه

# selectedAmountNotEqual
source: Selected amount not enough
ar: المبالغ المختارة غير كافية

# checkNo
source: Check number
ar: رقم الشيك

# transactionRef
source: trx ref
ar: رقم المعاملة

# thisTrxCannotBeClaimedOffline
source: This trx cannot be claimed offline cause it's contains multi payments trx
ar: لايمكن معالجة هذه المعاملة محليا لأنها من نوع متعدد الدفعات

source: Synced
ar: متزامنة

source: Do you want SMS alert ?
ar: إرسال رسالة تنبيه ؟

# enterPhoneNumber
source: Enter phone number i.e 123456789
ar: ادخل رقم الهاتف مثال : 123456789

source: Skip
ar: تخطي

# carNumberHint
source: enter car number
ar: ادخل لوحة العربة

source: Please fill empty fields
ar: من فضلك املئ الحقول الفارغة

# coupons
source: Coupon
ar: كوبونات

source: Apply coupon
ar: تطبيق كوبون

source: Clear
ar: مسح

source: Coupon applied
ar: تم تطبيق الكوبون

source: Add customer
ar: إضافة عميل

source: Credit
ar: ائتمان

source: Days limit
ar: الحد الأقصى للأيام

source: Credit limit
ar: الحد الأقصى للائتمان

source: Trn
ar: الرقم الضريبي

source: Email
ar: البريد الإلكتروني

source: Non credit
ar: غير ائتماني

source: Please choose customer type
ar: من فضلك اختر نوع العميل

source: Choose customer
ar: اختر عميل

source: Welcome back ,
ar: أهلا بعودتك يا

source: Orders
ar: الطلبات

# dinIn
source: Dine In
ar: الطاولات

source: Delivery
ar: التوصيل

source: Cart Preview
ar: تفاصيل السلة

source: Checkout
ar: الدفع

# defaultCashiers
source: Default Cashier
ar: الكاشير الافتراضي

source: Start fetching extra data
ar: بدء تحميل البيانات الاضافية

source: Start fetching User data
ar: بدء تحميل بيانات المستخدمين

source: Start fetching Customer data
ar: بدء تحميل بيانات الزبائن

source: Start fetching cashiers data
ar: بدء تحميل بيانات الكاشيرز

source: start fetching layout
ar: بدء تحميل بيانات الفاتورة

source: Order created successfully
ar: تم إنشاء طلب جديد بنجاح

source: Pending
ar: في الإنتظار

source: Approved
ar: تم القبول

source: In Kitchen
ar: في المطبخ

source: Ready
ar: جاهز

# catalogakOrder
source: Catalogak Orders
ar: الطلبات

source: Cashier
ar: الكاشير

source: Worker
ar: العامل

source: Customer
ar: الزبون

source: Order No.
ar: رقم الطلب

source: Order status
ar: حالة الطلب

source: Total quantity
ar: إجمالي المنتجات

source: Total price
ar: السعر الإجمالي

source: Unavailable
ar: غير متوفر

source: Edit Queue
ar: تعديل الطلب

source: Add Item
ar: إضافة عنصر

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Select All
ar: اختار الكل

source: Order ID
ar: معرف الطلب

source: Delete selected items
ar: حذف العناصر المختارة

source: Are you sure you want to delete all selected items
ar: هل أنت متأكد من رغبتك في حذف العناصر المختارة

source: Items from queue ?
ar: الموجودة في الطلب ؟

source: Add Item to queue
ar: أضف العناصر الجديدة للطلب

# areYouSureYouWantToSaveThisQueueChanges
source: Are you sure that you want to save new queue changes ?
ar: هل أنت متأكد من رغبتك في تعديل محتويات هذا الطلب

source: Unavailable for local report
ar: غير متوفر للتقرير المحلي

source: Local
ar: محلي

source: Daily Report
ar: التقرير اليومي

source: Report Date
ar: تاريخ التقرير

source: Report Summary
ar: الملخص

source: Claim Quantity
ar: كمية المرتجعات

source: Claim Amount
ar: قيمة المرتجعات

source: The End
ar: النهاية

source: Total Cash
ar: الإجمالي النقدي

source: Total Card
ar: إجمالي البطاقة

source: Discounts
ar: الخصومات

source: Subtotal
ar: الإجمالي

source: Type
ar: النوع

source: Quantity
ar: الكمية

# getSalesReport
source: Daily Sales
ar: التقرير اليومي

source: Print full report
ar: طباعة التقرير كامل

# printSummaryReport
source: Print summary only
ar: طباعة الملخص فقط

source: Sales Items
ar: العناصر المباعة

source: Operator
ar: مشغل

source: Cashier Management
ar: إدارة الكاشير

source: Add Cashier
ar: إضافة كاشير

source: Add Worker
ar: إضافة عامل

# addWorkerDescription
source: Add workers to your Catalogak POS app to store workers information and provide personalized services.
ar: أضف العمال إلى تطبيق Catalogak POS لتخزين معلومات العمال وتقديم خدمات مخصصة.

# addCashierDescription
source: Add cashiers to your Catalogak POS app to store workers information and provide personalized services.
ar: أضف الكاشير إلى تطبيق Catalogak POS لتخزين معلومات الكاشير وتقديم خدمات مخصصة.

source: Waiter
ar: نادل

source: Admin
ar: مشرف

source: Worker Management
ar: إدارة العمال

source: User management
ar: إدارة المستخدم

source: Cashier Name
ar: اسم الكاشير

source: Enter cashier name
ar: ادخل اسم الكاشير

source: Enter cashier password
ar: ادخل كلمة سر الكاشير

source: Permissions
ar: صلاحيات

source: Choose user permission
ar: اختار الصلاحيات للمستخدم

source: Update
ar: تحديث

source: Test Center
ar: مركز الاختبار

source: Print Testing
ar: اختبار الطباعة

source: Rejected
ar: مرفوض

source: Queue status changed successfully
ar: تم تحديث حالة الطلب بنجاح

source: Queue deleted successfully
ar: تم حذف الطلب بنجاح

source: Delete Queue
ar: حذف الطلب

# withQueueNumber
source: with Number {queueID}
ar: ذو الرقم {queueID}

# areSureAboutDeletingThisQueue
source: Are sure about deleting this order
ar: هل أنت متأكد في رغبتك بحذف الطلب

source: Not Found
ar: غير موجود

source: Backup database
ar: قاعدة بيانات احتياطية

source: Male
ar: ذكر

source: Worker name
ar: اسم العامل

source: Enter worker name
ar: ادخل اسم العامل

source: Gender
ar: الجنس

source: Edit cashier
ar: تعديل الكاشير

source: Edit worker
ar: تعديل العامل

source: Assign Worker
ar: اسناد عامل

source: Start fetching worker
ar: بدء عملية تنزيل بيانات العمال

source: Choose worker gender
ar: اختر جنس العامل

source: The cart empty
ar: السلة فارغة

source: Add missing worker please
ar: من فضلك قم بإسناد العمال للخدمات

source: Please add order status
ar: من فضلك قم بإضافة حالات الطلب

source: Product Recall
ar: تحديث المنتجات

source: Categories Recall
ar: تحديث التصنيفات

source: SubCategories Recall
ar: تحديث التصنيفات الفرعية

# configurations
source: Configuration
ar: تفضيلات

source: Recalls
ar: تحميلات

source: Worker required
ar: اضافة العمال اجبارية

source: Create order
ar: انشاء طلب

source: Create transaction
ar: انشاء معاملة

# newStatus
source: New
ar: جديد

# areYouSureYouWantCompleteThisOrder
source: Sure you want to complete this order ?
ar: هل انت متاكد من رغبتك في استكمال هذا الطلب ؟

source: Change status to complete
ar: استكمال الطلب

source: Card
ar: بطاقة

source: Order completed successfully
ar: تم استكمال الطلب بنجاح

source: Please choose worker gender
ar: الرجاء اختيار جنس العامل

source: Please add worker name
ar: من فضلك اضف اسم العامل

# fullInvoiceWorker
source: Activate full invoice worker
ar: تفعيل العامل على الفاتورة

source: Filter based
ar: على أساس التصفية

source: Tap Based
ar: على اساس الضغط

source: Order page layout type
ar: نوع تخطيط صفحة المنتجات

# defaultLayoutTicket
source: use default Layout Ticket
ar: استخدام التذكرة الافتراضية

# defaultLayoutToken
source: use default Layout Token
ar: استخدام تذكرة الطلب الافتراضية

source: Visa
ar: فيزا

source: Kitchen
ar: مطبخ

source: Table Preview
ar: معلومات عن الطاولة

source: Close Table
ar: إغلاق الطاولة

source: Table Assigned to your cart
ar: تم اسناد الطاولة للسلة

source: Are you sure you want to close this table ?
ar: هل انت متاكد من رغبتك في اغلاق هذه الطاولة

source: Choose the payment mode for collected amount
ar: اختر طريقة الدفع للمبلغ المحصل

source: Assign table
ar: اضف طاولة

source: Please select table that you want to assign next order to it
ar: الرجاء تحديد الطاولة الذي تريد تعيين الترتيب التالي له

# tableNumber
source: Table no.
ar: رقم الطاولة

source: Cart params
ar: ملاحظات

# setHangQuantity
source: Set hang
ar: تعيين الكمية المعلقة

source: Takeaway
ar: سفري

source: Add to cart
ar: اضف الى السلة

source: Quantity must be greater than zero
ar: الكمية يجب ان تكون اكبر من صفر

source: Expenses
ar: نفقات

source: Type Of Expenses
ar: نوع النفقات

# expenseAmount
source: Expenses Amount
ar: مبلغ النفقات

source: Notes
ar: ملاحظات

# expenseDate
source: Expenses Date
ar: تاريخ النفقات

# enterNote
source: Enter Notes here
ar: أدخل ملاحظاتك هنا

source: Add expense
ar: إضافة نفقة

source: Upload invoice
ar: ارفع فاتورة

source: Choose File
ar: اختر ملف

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# updateAssign
source: Update & Assign Customer
ar: تحديث وتعيين العميل

source: Assign Customer
ar: تعيين العميل

source: Start fetching countries
ar: بدء تحميل بيانات المدن

source: Choose Country
ar: اختر دولة

source: Choose City
ar: اختر مدينة

source: Search City
ar: ابحن عن مدينة

source: Search Country
ar: ابحث عن دولة

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Reset Cashier Password
ar: إعادة تعيين كلمة المرور

# enterQty
source: Enter quantity
ar: أدخل الكمية

source: Add Expense type
ar: أخدل نوع النفقة

source: Create payment
ar: إنشاء دفعة

source: View More details
ar: عرض تفاصيل

source: Credit Balance:
ar: الرصيد الدائن:

source: Total Orders
ar: عدد الطلبات الكلي

source: Total Transactions
ar: عدد المعاملات

source: Total Addresses
ar: عدد العناوين

# loyaltyScore
source: Loyalty Scour
ar: نقاط الولاء

source: Car Number:
ar: رقم السيارة :

source: Paid Amount
ar: المبلغ المدفوع

source: Payment
ar: دفعة

source: Credit History
ar: تاريخ الرصيد

source: View Credit History
ar: عرض تاريخ الرصيد

source: Transaction Details
ar: تفاصيل المعاملة

source: Price
ar: السعر

source: Transaction No
ar: رقم المعاملة

source: Transaction OfflineID
ar: رقم المعاملة محلي

source: Customer name
ar: اسم المستخدم

# addCustomerDec
source: Add Customer to store their information and provide personalized services
ar: أضف عميلًا لتخزين معلوماته وتقديم خدمات مخصصة

source: Assign NFC
ar: تعيين NFC

source: View
ar: عرض

source: Confirmation
ar: تأكيد

# deleteDesc
source: Are you sure you deleted the {customerName} and all their information?
ar: هل انت متأكد من حذف المستخدم {customerName}

source: Loyalty Points History
ar: تاريخ نقاط الولاء

source: Recharge
ar: تعبئة رصيد

source: View Points
ar: عرض النقاط

source: Points
ar: النقاط

source: Earned
ar: مكتسب

source: Spent
ar: انفق

source: Points Earned
ar: النقاط المكتسبة

source: Points Spent
ar: النقاط المنفقة

# selectCustomer
source: Please Select the Customer
ar: اختر عميل

# notEnoughPoints
source: The customer does not have enough points
ar: العميل لا يملك نقاط كافية

source: Pay By Point
ar: دفع بالنقاط

source: expire point
ar: انتهت صلاحية

source: Purchase
ar: شراء

# pointMsg
source: The greater numbers of orders a customer makes the higher points they get
ar: الأعداد الأكبر من الطلبات التي يقدمها العميل أعلى النقاط التي يحصلون عليه

# cantPayTotalAmountWithPoint
source: can't pay total amount by point
ar: لا يمكنك دفع كامل المبلغ نقاط

source: Available
ar: متاح

source: Assigned
ar: مُعيَّن

source: Replaced
ar: استبدال

source: Locked
ar: مقفل

source: Manage Nfc Cards
ar: إدارة البطاقات
